[
  {
    "path": "posts/2021-09-05-comm/",
    "title": "Water Balance in National Parks",
    "description": "Communication Capstone Project - University of California, Santa Barbara",
    "author": [
      {
        "name": "Keene Morrow",
        "url": {}
      }
    ],
    "date": "2021-09-05",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-09-05T15:03:01-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-05-cpast/",
    "title": "Clean Power Alliance Service Territory",
    "description": "Part of the Local Clean Energy Vision for Southern California project.",
    "author": [],
    "date": "2021-09-05",
    "categories": [],
    "contents": "\r\nClean Power Alliance currently serves commercial and residential customers in thirty member jurisdictions and the unincorporated portions of Los Angeles and Ventura Counties, shown in teal below. In these places, customers are automatically enrolled to receive electricity from Clean Power Alliance. Each jurisdiction has a default percentage of electricity coming from renewable energy sources, choosing 36% (light green on the map), 50% (medium green), or 100% (dark green). Cities that are not member jurisdictions of Clean Power Alliance are shown here with black outlines.\r\nClick on a jurisdiction to learn more.\r\n\r\n\r\nCustomers have the option of opting-up to a higher percentage of their electricity coming from renewable energy sources, opting-down, or opting out entirely and receiving their electricity exclusively from Southern California Edison. Clean Power Alliance purchases renewable energy and delivers it via the grid maintained by Southern California Edison.\r\nThis webmap was created in QGIS as part of the Local Clean Energy Vision for Southern California project.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-09-05T15:15:50-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-05-gp/",
    "title": "Local Clean Energy Vision for Southern California",
    "description": "Thesis-Equivalent Master's Group Project - University of California, Santa Barbara",
    "author": [],
    "date": "2021-09-05",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-09-05T15:03:02-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-05-publr/",
    "title": "Connecticut Public Use and Benefit Land Registry",
    "description": "Connecticut Department of Energy and Environmental Protection in collaboration with Eastern Connecticut State University.",
    "author": [],
    "date": "2021-09-05",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-09-05T15:03:02-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-05-thesis/",
    "title": "Hydrologic Modeling of the Impacts of Climate Change in the Fenton River Basin",
    "description": "Undergraduate Honors Thesis - University of Connecticut",
    "author": [],
    "date": "2021-09-05",
    "categories": [],
    "contents": "\r\nFor my undergraduate honors thesis, I developed a 2D spatially distributed hydrologic model of the Fenton River watershed using TopoFlow, performed quality control by comparing its outputs to USGS gauge data from actual storm events in 2012, and modeled various hydrologic scenarios for Holocene and projected future climate conditions.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-09-05T15:03:02-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-05-waca/",
    "title": "Spatial Material Flow Analysis for the West African Coastal Region",
    "description": "World Bank Group",
    "author": [],
    "date": "2021-09-05",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-09-05T15:03:02-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-05-welcome/",
    "title": "Welcome",
    "description": "This is an overview of some of the projects that I've worked on!",
    "author": [
      {
        "name": "Keene Morrow",
        "url": {}
      }
    ],
    "date": "2021-09-05",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-09-05T15:03:02-07:00",
    "input_file": {}
  }
]
