[
  {
    "path": "posts/2021-09-17-climateau/",
    "title": "Climate: Australian Cities",
    "description": "Explore the climate of five cities Down Under.",
    "author": [],
    "date": "2022-03-18",
    "categories": [],
    "contents": "\r\nIntroduction\r\nAt the end of 2019 and beginning of 2020, Australia experienced devastating bushfires. More than 11 million hectares burned, principally in the southeast provinces of New South Wales and Victoria. Only thirty-three people lost their lives, but more than a billion animals are estimated to have been killed, including on Kangaroo Island, a haven for biological diversity.\r\nThe current government of Australia shies away from connecting the intensity of the bushfires to climate change or acknowledging the intense impacts of climate change on the country. Climate scientists, on the other hand, agree that the extremely high temperatures and severe drought that fueled the bushfires are undoubtedly linked to climate change. (BBC)\r\nIn light of the devastation of these fires, the R For Data Science #tidytuesday prompt for January 7, 2020 included data on the fires and the climate of Australia. Here, temperature and rainfall data are used to construct climatology graphs for five Australian cities: Brisbane, Canberra, Melbourne, Perth, and Sydney.\r\nSet Up\r\n\r\n\r\nlibrary(tidyverse)\r\nlibrary(lubridate)\r\nlibrary(here)\r\n\r\n\r\n\r\nRead Data\r\n\r\n\r\nrainfall <- readr::read_csv('https://raw.githubusercontent.com/rfordatascience/tidytuesday/master/data/2020/2020-01-07/rainfall.csv')\r\n\r\ntemperature <- readr::read_csv('https://raw.githubusercontent.com/rfordatascience/tidytuesday/master/data/2020/2020-01-07/temperature.csv')\r\n\r\n\r\n\r\nWrangling\r\nRainfall\r\n\r\n\r\nrain_date <- rainfall %>%\r\n  mutate(date_new = lubridate::ymd(paste(year, month, day, sep = \"-\"))) %>% # concatenate dates and make them Date type\r\n  mutate(month = as.numeric(month)) %>% # prep months for applying names\r\n  mutate(month_name = month.abb[month]) %>%  # apply names to months\r\n  mutate(month_name = fct_relevel(month_name, levels = month.abb)) # relevel to get month names in order\r\n\r\n\r\n\r\nTemperature\r\n\r\n\r\ntemp <- temperature %>%\r\n  mutate(city_name = str_to_title(city_name)) %>% #clean up city names (BRISBANE to Brisbane)\r\n  mutate(month = lubridate::month(date)) %>% # pull month from date\r\n  mutate(month_name = month.abb[month]) %>%  # apply names to months\r\n  mutate(month_name = fct_relevel(month_name, levels = month.abb)) %>%  # relevel month names\r\n  mutate(year = lubridate::year(date))\r\n\r\n\r\n\r\nPrep Data for Constructing Climatologies\r\n\r\n\r\ntemp_summary <-  temp %>%\r\n  drop_na() %>% # this probably isn't a good idea, but let's assume that the loss of data is evenly distributed throughout the time range and doesn't impact the mean monthly temperature\r\n  group_by(city_name, month_name, temp_type) %>%\r\n  summarize(mean_temp = mean(temperature)) %>%\r\n  pivot_wider(names_from = temp_type, values_from = mean_temp, names_prefix = \"mean_temp_\")\r\n\r\nrain_summary <- rain_date %>%\r\n  mutate(rain_0 = ifelse(is.na(rainfall), 0, rainfall)) %>% # another questionable assumption\r\n  group_by(city_name, month_name) %>%\r\n  summarize(mean_rainfall = mean(rain_0))\r\n\r\nclimate_mean <- merge(temp_summary, rain_summary)\r\n\r\ncities <- unique(climate_mean$city_name) # gets list of the common cities from the merge\r\n\r\n\r\n\r\nPlotting Climatologies\r\n\r\n\r\n# Plot one climatology per city with both temperature and rainfall data (missing some sloppily removed before)\r\n\r\nfor(i in seq_along(cities)){\r\n  # plot data for each city common between the temperature and rainfall data\r\n  ggplot(data = subset(climate_mean, climate_mean$city_name == cities[i])) +\r\n    # blue columns for rainfall\r\n    geom_col(aes(x = month_name,\r\n                 y = mean_rainfall*4), # adjustment to make the scales work together\r\n             color = \"navy\", fill = \"blue\", alpha = 0.6) +\r\n    # red ribbon for area between mean max temp and mean min temp\r\n    geom_ribbon(aes(x = month_name,\r\n                    ymax = mean_temp_max,\r\n                    ymin = mean_temp_min, group = 1),\r\n                fill = \"red\",\r\n                alpha = 0.3) +\r\n    # red line and points for mean temeprature as mean of mean max and min temp\r\n    geom_line(aes(x = month_name,\r\n                  y = ((mean_temp_max + mean_temp_min)/2),\r\n                  group = 1),\r\n              color = \"red\",\r\n              size = 1) +\r\n    geom_point(aes(x = month_name,\r\n                   y = ((mean_temp_max + mean_temp_min)/2)),\r\n               color = \"red\") +\r\n    # scale wrangling\r\n    scale_y_continuous(limits = c(-2, 35), # keeps scales consistent across plots\r\n                       sec.axis = sec_axis(~./4, name = \"Rainfall (mm)\")) + # adds second axis for rainfall, adjusted to counteract the scale factor above\r\n    scale_colour_manual(values = c(\"blue\", \"red\")) +\r\n    labs(y = \"Temperature (°C)\",\r\n         x = \"\",\r\n         title = \"Monthly Mean Temperature Range & Mean Rainfall\",\r\n         # subtitle of plot based on city in question\r\n         subtitle = paste(cities[i],\", Australia\", sep = \"\"),\r\n         caption = paste(\"Mean monthly temperature shown as red points and line with the range between the mean\\nmaximum and mean minimum temperatures shaded in red; blue columns show mean\\nmonthly rainfall for \", cities[i], \", Australia.\\n\\nData: Australian Bureau of Meterology\\n#tidytuesday 2020-01-07\\nKeene Morrow\",\r\n                         sep = \"\")) + \r\n    theme_minimal() +\r\n    theme(plot.caption = element_text(hjust = 0, face = \"italic\"))\r\n  \r\n  ggsave(here::here(\"figures\", paste(cities[i], \"_climate.png\", sep = \"\")),\r\n         height = 7, width = 7)\r\n}\r\n\r\n\r\n\r\nThe resulting figures can be easily compared due to their standardization and the method applied to other datasets.\r\n\r\n\r\n\r\n\r\n\r\nSummary\r\nWrangled dates with lubridate.\r\nMade some questionable assumptions about NA’s in the data.\r\nUsed for loop to generate five plots of climatologies, one for each of the cities with data for both temperature and rainfall.\r\nReferences\r\n“Australia Fires.” #tidytuesday, R for Data Science. https://github.com/rfordatascience/tidytuesday/tree/master/data/2020/2020-01-07\r\n“Australia fires: A visual guide to the bushfire crisis.” British Broadcasting Company. 2020-01-31. https://www.bbc.com/news/world-australia-50951043\r\n“Climate Data Online.” Australian Bureau of Meterology. http://www.bom.gov.au/climate/data/\r\nGill, Victoria. “Australia fires were far worse than any prediction.” British Broadcasting Company. 2020-02-24. https://www.bbc.com/news/science-environment-51590080?intlink_from_url=https://www.bbc.com/news/topics/c2wlvy54gd1t/australia-fires&link_location=live-reporting-story\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-03-18T15:32:05-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-10-01-boats/",
    "title": "Working on Boats",
    "description": "I spent several years working as a place-based educator aboard tall ships. The experience has shaped everything that I've done since.",
    "author": [],
    "date": "2021-10-21",
    "categories": [],
    "contents": "\r\nIt’s sometimes also an incredibly difficult experience to describe.\r\nThe Basics\r\nBetween April 2014 and November 2015 then again in 2018 I worked on five different tall ships on the East Coast and in the Pacific Northwest. A tall ship is an amorphous designation for traditionally-rigged sailing vessels, ranging from sloops and schooners to brigs and barquetines.\r\nThe five boats that I worked on are:\r\nClearwater operated by Hudson River Sloop Clearwater\r\nAdventuress operated by Sound Experience\r\nBrilliant operated by Mystic Seaport\r\nAJ Meerwald operated by Bayshore Center at Bivalve\r\nMystic Whaler operated by Mystic Whaler Cruises for Hudson River Sloop Clearwater\r\nEach one offered different a perspective on the modern maritime industry through the lens of education. While Brilliant focused on teen sail training for the summer I was onboard, the other organizations are dedicated to place-based environmental education.\r\nThe Takeaways\r\nThe education-driven missions of these boats combine with the requirements for successfully operating them to create a strong sense of community and incredible feats of teamwork. Within the first two weeks of setting foot on my first boat, I found myself working with a dozen other people to safely maneuver a massive fuel tank below decks and through a door into the tight quarters of the bosun’s locker. It was an endeavor that required strength and coordination as well as incredible synergy between the crew and our leadership and just one of many delicate tasks I helped achieve that season and in my other positions on other boats. At the end, exhausted and exhilarated, I scrambled out of the depths of the locker, over the newly placed fuel tank, and up to the deck to replace the hatch and have a well deserved drink of water with my shipmates.\r\nIt was on boats that I gained expertise in communicating complex concepts to individuals and groups with diverse backgrounds and knowledge levels. From explaining plankton to 5 year-olds to discussing the nuances of energy policy’s impacts on riparian and marine ecosystems to talking about marine mammals in French, the tasks I took on as an educator tested then expanded my abilities. This experience particularly contributed to my success working on the Connecticut Public Use and Benefit Land Registry, allowing me to connect with different stakeholders and successfully develop the internship program that catapulted the project to success.\r\nThis work also contributed to my systems-based approach to problem solving. When operating a vessel there is a constant ebb and flow of tasks that need to happen to accomplish the goals set forward by the captain. If one part out of a dozen does not execute correctly, the entire process is at risk of failure. As a crewmember, I developed the ability to swiftly assess the task that was presented, observe what aspects were complete or underway, and dynamically step into roles that needed to be done before moving on to the next task. I find that this approach to problem solving came through particularly strongly while working on my thesis-equivalent master’s group project, where my role as data manager led me to support my team in myriad ways, each requiring different skills, insights, and tasks in a dynamic landscape of urgency and complexity.\r\nA Typical Day Onboard Clearwater\r\n0645 Wakeups with music or poetry\r\n0700 Report on deck for morning deck wash\r\n0730 Breakfast\r\n0800 Post-breakfast chores and set up for the day’s programs\r\n0900 Morning program\r\nOn shore introduction and group creation\r\nBoard vessel and receive captain’s safety briefing\r\nCrew gets the boat off the dock while the participants have a group activity with the education team\r\nCrew and participants raise the sails\r\nEducation stations in small groups (3 of 5)\r\nMoment of silence broken by music or poetry\r\nFull group activity\r\nEducation stations in small groups (Remaining 2 of 5)\r\nCrew gets the boat tied up at the dock while the participants have a group activity with the education team\r\nParticipants disembark\r\n1200 Lunch\r\n1300 Afternoon program following the same format as above\r\n1600 Afternoon deck wash, maintenance, and training\r\n1800 Dinner\r\n1900 Stood down! (Work is done for the day and only the designated person on watch has duties until the next morning.)\r\nFAQ’s\r\nAre you pirates? No.\r\nDo you live onboard? Yes. While we’re working onboard, we live on the boat and travel with with it to different ports. Below decks are cabins and bunks for us to sleep in, a galley to make food in, and space for us to spend time together at meals and in off hours.\r\nHow often do you climb aloft? On the boats I worked on it wasn’t necessary to leave the deck to change the sails. Typically\r\nWhat are those fuzzy thing?  Baggywrinkles. These are made from old rope tied to make a pompom-like mop. We put them on the parts of the rigging that could wear holes in the sails to prevent that. Baggywrinkles are a kind of chafe gear, or materials that are used to pad or protect ropes, sails, and other areas to keep them in good condition for as long as possible. Another common form of chafe gear is lengths of old fire hose tied around docklines at places where they may rub on the dock, pilings, or boat as the waves and tides move the boat.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-10-21T10:49:41-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-05-comm/",
    "title": "Water Balance in National Parks",
    "description": "Communication Capstone Project - University of California, Santa Barbara",
    "author": [],
    "date": "2021-09-14",
    "categories": [],
    "contents": "\r\nStudents in the Bren School of Environmental Science & Management Strategic Environmental Communication complete a capstone project for a client as part of their interdisciplinary communication education.\r\nIn collaboration with two other students and the National Parks Service, I developed and presented an ESRI StoryMap entitled Water Balance in National Parks.\r\nExplore the StoryMap.\r\nWatch the presentation here.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-09-21T19:35:17-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-05-cpast/",
    "title": "Clean Power Alliance Service Territory",
    "description": "Part of the Local Clean Energy Vision for Southern California project.",
    "author": [],
    "date": "2021-09-05",
    "categories": [],
    "contents": "\r\nClean Power Alliance currently serves commercial and residential customers in thirty member jurisdictions and the unincorporated portions of Los Angeles and Ventura Counties, shown in teal below. In these places, customers are automatically enrolled to receive electricity from Clean Power Alliance. Each jurisdiction has a default percentage of electricity coming from renewable energy sources, choosing 36% (light green on the map), 50% (medium green), or 100% (dark green). Cities that are not member jurisdictions of Clean Power Alliance are shown here with black outlines.\r\nClick on a jurisdiction to learn more.\r\n\r\n\r\nCustomers have the option of opting-up to a higher percentage of their electricity coming from renewable energy sources, opting-down, or opting out entirely and receiving their electricity exclusively from Southern California Edison. Clean Power Alliance purchases renewable energy and delivers it via the grid maintained by Southern California Edison.\r\nThis webmap was created in QGIS as part of the Local Clean Energy Vision for Southern California project.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-09-21T19:35:17-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-05-gp/",
    "title": "Local Clean Energy Vision for Southern California",
    "description": "Thesis-Equivalent Master's Group Project - University of California, Santa Barbara",
    "author": [],
    "date": "2021-09-05",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-09-21T19:35:18-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-05-publr/",
    "title": "Connecticut Public Use and Benefit Land Registry",
    "description": "Connecticut Department of Energy and Environmental Protection in collaboration with Eastern Connecticut State University.",
    "author": [],
    "date": "2021-09-05",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-09-21T19:35:18-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-05-thesis/",
    "title": "Hydrologic Modeling of the Impacts of Climate Change in the Fenton River Basin",
    "description": "Undergraduate Honors Thesis - University of Connecticut",
    "author": [],
    "date": "2021-09-05",
    "categories": [],
    "contents": "\r\nFor my undergraduate honors thesis, I developed a 2D spatially distributed hydrologic model of the Fenton River watershed using TopoFlow, performed quality control by comparing its outputs to USGS gauge data from actual storm events in 2012, and modeled various hydrologic scenarios for Holocene and projected future climate conditions.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-09-21T19:35:18-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-05-waca/",
    "title": "Spatial Material Flow Analysis for the West African Coastal Region",
    "description": "World Bank Group",
    "author": [],
    "date": "2021-09-05",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-09-21T19:35:18-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-05-welcome/",
    "title": "Welcome",
    "description": "This is an overview of some of the projects that I've worked on!",
    "author": [
      {
        "name": "Keene Morrow",
        "url": {}
      }
    ],
    "date": "2021-09-05",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-09-21T19:35:18-07:00",
    "input_file": {}
  }
]
